In [1]:
import pandas

In [2]:
pandas.read_csv('/Users/nehamishra/Documents/StudentDataCSV.csv')

   Roll No  Name Batch
0     1001  Stu1    B1
1     1002  Stu2    B2
2     1003  Stu3    B3
3     1004  Stu4    B4

In [3]:
pandas.read_csv('/Users/nehamishra/Documents/StudentDataTSV.tsv', sep='\t')

   Roll No  Name Batch
0     1001  Stu1    B1
1     1002  Stu2    B2
2     1003  Stu3    B3
3     1004  Stu4    B4

In [4]:
pandas.read_excel('/Users/nehamishra/Documents/StudentDataxlsx.xlsx')

   Roll No  Name Batch
0     1001  Stu1    B1
1     1002  Stu2    B2
2     1003  Stu3    B3
3     1004  Stu4    B4